In [1]:
# def sqliteDBfromIMDB():
import pandas as pd
#import postgres as pg
import sqlite3
import sys
sys.path.insert(0, '../drivers')

In [2]:
df1 = pd.read_csv('../rawData/ml-latest/movies.csv', index_col=0) 
df1.head()

,title,genres
movieId,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,Jumanji (1995),Adventure|Children|Fantasy
3,Grumpier Old Men (1995),Comedy|Romance
4,Waiting to Exhale (1995),Comedy|Drama|Romance
5,Father of the Bride Part II (1995),Comedy

In [3]:
df2 = pd.read_csv('../rawData/ml-latest/ratings.csv', index_col=1) 
df2.head()

/home/manohar/anaconda3/lib/python3.7/site-packages/numpy/lib/arraysetops.py:522: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask |= (ar1 == a)

         userId  rating   timestamp
movieId
2             1     3.5  1112486027
29            1     3.5  1112484676
32            1     3.5  1112484819
47            1     3.5  1112484727
50            1     3.5  1112484580

In [4]:
df3 = pd.read_csv('../rawData/ml-latest/tags.csv', index_col=1) 
df3.head()

         userId            tag   timestamp
movieId
4141         18    Mark Waters  1240597180
208          65      dark hero  1368150078
353          65      dark hero  1368150079
521          65  noir thriller  1368149983
592          65      dark hero  1368150078

In [5]:
df4 = pd.read_csv('../rawData/ml-latest/genome-scores.csv', index_col=0) 
df4.head()

         tagId  relevance
movieId
1            1    0.02500
1            2    0.02500
1            3    0.05775
1            4    0.09675
1            5    0.14675

In [6]:
df5 = pd.read_csv('../rawData/ml-latest/genome-tags.csv', index_col=0) 
df5.head()

                tag
tagId
1               007
2      007 (series)
3      18th century
4             1920s
5             1930s

In [7]:
df6 = pd.read_csv('../rawData/ml-latest/links.csv', index_col=0) 
df6.head()

         imdbId   tmdbId
movieId
1        114709    862.0
2        113497   8844.0
3        113228  15602.0
4        114885  31357.0
5        113041  11862.0

In [8]:
db = sqlite3.connect('../database/ML_latest.db')
#db.executescript(DB_SETUP)
df1.to_sql('ml_movies', db)

In [9]:
df2.to_sql('ml_ratings', db)

In [10]:
df3.to_sql('ml_tags', db)

In [11]:
df4.to_sql('ml_genome-scores', db)

In [12]:
df5.to_sql('ml_genome-tags', db)

In [13]:
df6.to_sql('ml_links', db)